2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/PUC700-Verhuizing_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header/>
	<soapenv:Body>
		<brp:bhg_vbaRegistreerVerhuizing xmlns:brp="http://www.bzk.nl/brp/brp0200" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
				<brp:zendendePartij>${DataSource Values#zendendePartij_zsM0}</brp:zendendePartij>
				<brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsM0}</brp:zendendeSysteem>
				<brp:referentienummer>${DataSource Values#referentienummer_sMM0}</brp:referentienummer>
				<brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
			</brp:stuurgegevens>
			<brp:parameters brp:communicatieID="${DataSource Values#comid.parameters}">
				<brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pMM0}</brp:verwerkingswijze>
			</brp:parameters>
			<brp:verhuizingBinnengemeentelijk brp:communicatieID="${DataSource Values#comid.regBinnengemVerhuizing}"
                                                brp:objecttype="AdministratieveHandeling">
				<brp:partijCode>${DataSource Values#partijCode_rMM0}</brp:partijCode>
				<brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rMM0}</brp:toelichtingOntlening>
				<brp:gedeblokkeerdeMeldingen>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding0}" brp:objecttype="GedeblokkeerdeMelding"
                                   brp:referentieID="${DataSource Values#refid.gedeblokkeerdeMelding0}">
						<brp:regelCode>${DataSource Values#regelCode_ggr0}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggr0}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding1}" brp:objecttype="GedeblokkeerdeMelding"
                                   brp:referentieID="${DataSource Values#refid.gedeblokkeerdeMelding1}">
						<brp:regelCode>${DataSource Values#regelCode_ggr1}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggr1}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
				</brp:gedeblokkeerdeMeldingen>
				<brp:bronnen>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron1}">
						<brp:document brp:communicatieID="Document1" brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbr0}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbr0}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbr0}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbr0}</brp:partijCode>
						</brp:document>
					</brp:bron>
				</brp:bronnen>
				<brp:acties>
					<brp:registratieAdres brp:communicatieID="${DataSource Values#comid.registratieAdres1}" brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid >${DataSource Values#datumAanvangGeldigheid_rar0}</brp:datumAanvangGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument1"
                          brp:referentieID="${DataSource Values#refid.brondocument1}"
                          brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="${DataSource Values#comid.persoon0}" brp:objecttype="Persoon"
                        brp:objectSleutel="${DataSource Values#|objectid.burgerservicenummer_ipv0|}">
							<brp:adressen>
								<brp:adres brp:communicatieID="${DataSource Values#comid.adres0}" brp:objecttype="PersoonAdres">
									<brp:soortCode>${DataSource Values#soortCode_aap0}</brp:soortCode>
									<brp:redenWijzigingCode>${DataSource Values#redenWijzigingCode_aap0}</brp:redenWijzigingCode>
									<brp:aangeverAdreshoudingCode>${DataSource Values#aangeverAdreshoudingCode_aap0}</brp:aangeverAdreshoudingCode>
									<brp:datumAanvangAdreshouding>${DataSource Values#datumAanvangAdreshouding_aap0}</brp:datumAanvangAdreshouding>
									<brp:identificatiecodeAdresseerbaarObject>${DataSource Values#identificatiecodeAdresseerbaarObject_aap0}</brp:identificatiecodeAdresseerbaarObject>
									<brp:identificatiecodeNummeraanduiding>${DataSource Values#identificatiecodeNummeraanduiding_aap0}</brp:identificatiecodeNummeraanduiding>
									<brp:naamOpenbareRuimte>${DataSource Values#naamOpenbareRuimte_aap0}</brp:naamOpenbareRuimte>
									<brp:afgekorteNaamOpenbareRuimte>${DataSource Values#afgekorteNaamOpenbareRuimte_aap0}</brp:afgekorteNaamOpenbareRuimte>
									<brp:gemeentedeel>${DataSource Values#gemeentedeel_aap0}</brp:gemeentedeel>
									<brp:huisnummer>${DataSource Values#huisnummer_aap0}</brp:huisnummer>
									<brp:huisletter>${DataSource Values#huisletter_aap0}</brp:huisletter>
									<brp:huisnummertoevoeging>${DataSource Values#huisnummertoevoeging_aap0}</brp:huisnummertoevoeging>
									<brp:postcode>${DataSource Values#postcode_aap0}</brp:postcode>
									<brp:woonplaatsnaam>${DataSource Values#woonplaatsnaam_aap0}</brp:woonplaatsnaam>
									<brp:locatieTenOpzichteVanAdres>${DataSource Values#locatieTenOpzichteVanAdres_aap0}</brp:locatieTenOpzichteVanAdres>
									<brp:locatieomschrijving>${DataSource Values#locatieomschrijving_aap0}</brp:locatieomschrijving>
								</brp:adres>
							</brp:adressen>
						</brp:persoon>
					</brp:registratieAdres>
				</brp:acties>
			</brp:verhuizingBinnengemeentelijk>
			<brp:verhuizingIntergemeentelijk brp:communicatieID="${DataSource Values#comid.regIntergemVerhuizing}"
                                               brp:objecttype="AdministratieveHandeling">
				<brp:partijCode>${DataSource Values#partijCode_rMM1}</brp:partijCode>
				<brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rMM1}</brp:toelichtingOntlening>
				<brp:gedeblokkeerdeMeldingen>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding2}" brp:objecttype="GedeblokkeerdeMelding"
                                   brp:referentieID="${DataSource Values#refid.gedeblokkeerdeMelding2}">
						<brp:regelCode>${DataSource Values#regelCode_ggr2}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggr2}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding3}" brp:objecttype="GedeblokkeerdeMelding"
                                   brp:referentieID="${DataSource Values#refid.gedeblokkeerdeMelding3}">
						<brp:regelCode>${DataSource Values#regelCode_ggr3}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggr3}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
				</brp:gedeblokkeerdeMeldingen>
				<brp:bronnen>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron2}">
						<brp:document brp:communicatieID="Document2" brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbr1}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbr1}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbr1}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbr1}</brp:partijCode>
						</brp:document>
					</brp:bron>
				</brp:bronnen>
				<brp:acties>
					<brp:registratieAdres brp:communicatieID="${DataSource Values#comid.registratieAdres}" brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid >${DataSource Values#datumAanvangGeldigheid_rar1}</brp:datumAanvangGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument2"
                          brp:referentieID="${DataSource Values#refid.brondocument2}"
                          brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="${DataSource Values#comid.persoon1}" brp:objecttype="Persoon"
                        brp:objectSleutel="${DataSource Values#|objectid.burgerservicenummer_ipv1|}">
							<brp:adressen>
								<brp:adres brp:communicatieID="${DataSource Values#comid.adres1}" brp:objecttype="PersoonAdres">
									<brp:soortCode>${DataSource Values#soortCode_aap1}</brp:soortCode>
									<brp:redenWijzigingCode>${DataSource Values#redenWijzigingCode_aap1}</brp:redenWijzigingCode>
									<brp:aangeverAdreshoudingCode>${DataSource Values#aangeverAdreshoudingCode_aap1}</brp:aangeverAdreshoudingCode>
									<brp:datumAanvangAdreshouding>${DataSource Values#datumAanvangAdreshouding_aap1}</brp:datumAanvangAdreshouding>
									<brp:identificatiecodeAdresseerbaarObject>${DataSource Values#identificatiecodeAdresseerbaarObject_aap1}</brp:identificatiecodeAdresseerbaarObject>
									<brp:identificatiecodeNummeraanduiding>${DataSource Values#identificatiecodeNummeraanduiding_aap1}</brp:identificatiecodeNummeraanduiding>
									<brp:gemeenteCode>${DataSource Values#gemeenteCode_aap0}</brp:gemeenteCode>
									<brp:naamOpenbareRuimte>${DataSource Values#naamOpenbareRuimte_aap1}</brp:naamOpenbareRuimte>
									<brp:afgekorteNaamOpenbareRuimte>${DataSource Values#afgekorteNaamOpenbareRuimte_aap1}</brp:afgekorteNaamOpenbareRuimte>
									<brp:gemeentedeel>${DataSource Values#gemeentedeel_aap1}</brp:gemeentedeel>
									<brp:huisnummer>${DataSource Values#huisnummer_aap1}</brp:huisnummer>
									<brp:huisletter>${DataSource Values#huisletter_aap1}</brp:huisletter>
									<brp:huisnummertoevoeging>${DataSource Values#huisnummertoevoeging_aap1}</brp:huisnummertoevoeging>
									<brp:postcode>${DataSource Values#postcode_aap1}</brp:postcode>
									<brp:woonplaatsnaam>${DataSource Values#woonplaatsnaam_aap1}</brp:woonplaatsnaam>
									<brp:locatieTenOpzichteVanAdres>${DataSource Values#locatieTenOpzichteVanAdres_aap1}</brp:locatieTenOpzichteVanAdres>
									<brp:locatieomschrijving>${DataSource Values#locatieomschrijving_aap1}</brp:locatieomschrijving>
								</brp:adres>
							</brp:adressen>
						</brp:persoon>
					</brp:registratieAdres>
				</brp:acties>
			</brp:verhuizingIntergemeentelijk>
			<brp:verhuizingNaarBuitenland
                                       brp:communicatieID="id.verhuizingNaarBuitenland0"
                                       brp:objecttype="AdministratieveHandeling">
				<brp:partijCode>${DataSource Values#partijCode_vMB2}</brp:partijCode>
				<brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_vMB2}</brp:toelichtingOntlening>
				<brp:gedeblokkeerdeMeldingen>
					<brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding4" brp:referentieID="${DataSource Values#refid.gedeblokkeerdeMelding4}"
                                          brp:objecttype="GedeblokkeerdeMelding">
						<brp:regelCode>${DataSource Values#regelCode_ggv4}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggv4}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
					<brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding5" brp:referentieID="${DataSource Values#refid.gedeblokkeerdeMelding5}"
                                          brp:objecttype="GedeblokkeerdeMelding">
						<brp:regelCode>${DataSource Values#regelCode_ggv5}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggv5}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
				</brp:gedeblokkeerdeMeldingen>
				<brp:bronnen>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron3}">
						<brp:document brp:communicatieID="Document3" brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbv6}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbv6}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbv6}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbv6}</brp:partijCode>
						</brp:document>
					</brp:bron>
				</brp:bronnen>
				<brp:acties>
					<brp:registratieMigratie brp:communicatieID="id.registratieMigratie4" brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rav4}</brp:datumAanvangGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument3"
							  brp:referentieID="${DataSource Values#refid.brondocument3}"
							  brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="id.persoon4" brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|objectid.burgerservicenummer_ipv4|}">
							<brp:migratie brp:communicatieID="id.migratie">
								<brp:redenWijzigingCode>${DataSource Values#redenWijzigingCode_mig}</brp:redenWijzigingCode>
								<brp:aangeverCode>${DataSource Values#aangeverCode_mig}</brp:aangeverCode>
								<brp:landGebiedCode>${DataSource Values#landgebiedcode_mig}</brp:landGebiedCode>
								<brp:identificatiecodeAdresseerbaarObject>${DataSource Values#identificatiecodeAdresseerbaarObject_mig}</brp:identificatiecodeAdresseerbaarObject>
								<brp:buitenlandsAdresRegel1>${DataSource Values#migratie_bla1}</brp:buitenlandsAdresRegel1>
								<brp:buitenlandsAdresRegel2>${DataSource Values#migratie_bla2}</brp:buitenlandsAdresRegel2>
								<brp:buitenlandsAdresRegel3>${DataSource Values#migratie_bla3}</brp:buitenlandsAdresRegel3>
								<brp:buitenlandsAdresRegel4>${DataSource Values#migratie_bla4}</brp:buitenlandsAdresRegel4>
								<brp:buitenlandsAdresRegel5>${DataSource Values#migratie_bla5}</brp:buitenlandsAdresRegel5>
								<brp:buitenlandsAdresRegel6>${DataSource Values#migratie_bla6}</brp:buitenlandsAdresRegel6>
							</brp:migratie>
						</brp:persoon>
					</brp:registratieMigratie>
					<brp:wijzigingVerstrekkingsbeperking brp:communicatieID="id.wijzigingVerstrekkingsbeperking2"
                                                      brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rav5}</brp:datumAanvangGeldigheid>
						<brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rav5}</brp:datumEindeGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument4"
							  brp:referentieID="${DataSource Values#refid.brondocument4}"
							  brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="id.persoon5" brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|objectid.burgerservicenummer_ipv5|}">
							<brp:indicaties>
								<brp:volledigeVerstrekkingsbeperking brp:communicatieID="id.verstrekkingsbeperking2"
                                                    brp:objecttype="PersoonIndicatie">
									<brp:waarde>${DataSource Values#waarde_vip2}</brp:waarde>
								</brp:volledigeVerstrekkingsbeperking>
							</brp:indicaties>
						</brp:persoon>
					</brp:wijzigingVerstrekkingsbeperking>
				</brp:acties>
			</brp:verhuizingNaarBuitenland>
		</brp:bhg_vbaRegistreerVerhuizing>
	</soapenv:Body>
</soapenv:Envelope>
